import React from "react";
import FoodRecipe from "./FoodRecipe";
import { useState, useEffect } from "react";
import { useLocation } from "react-router-dom";


const RecipePage3 = (props) => {

 
  const [inputValue, setInputValue] = useState(100); 

  const data = [  

    {
      key:"1",
      in:20,
      name:"Βοδινό:",
      end:"κιλά" 
    },
    {
      key:"2",
      in:25,
      name:"Κρεμμύδια:",
      end:"κιλά" 
    },
    {
      key:"3",
      in:3,
      name:"Λάδι:",
      end:"κιλά" 
    },
    {
      key:"4",
      in:1,
      name:"Τοματοπολτός:",
      end:"κιλά" 
    },
    {
      key:"5",
      in:1,
      name:"Ξύδι:",
      end:"φιάλη" 
    },
    {
      key:"6",
      in:5,
      name:"Σκόρδα:",
      end:"κεφάλια" 
    },
    {
      key:"7",
      in:"",
      name:"Δεντρολίβανο",
      end:"" 
    },
    {
      key:"8",
      in:"",
      name:"Φύλλα Δάφνης",
      end:"" 
    },
    {
      key:"9",
      in:"",
      name:"Αλάτι - Μπαχάρι - Πιπέρι",
      end:"" 
    },
    {
      key:"10",
      in:10,
      name:"Κανέλα",
      end:"ξυλάκια" 
    },
    {
      key: "11",
      foodname: "ΚΡΕΑΣ ΒΟΔΙΝΟ ΣΤΙΦΑΔΟ",
    },
    {
      key: "12",
      img: "https://www.tastycooking.gr/wp-content/uploads/2016/11/mosxari-stifado-syntagi.jpg",
    },
    {
      key: "13",
      description:
        "Κόβετε το κρέας σε μερίδες, το πλένετε και το βάζετε σε κατσαρόλα με νερό να βράσει και το ξαφρίζετε. Βάζετε το λάδι να κάψει και τσιγαρίζετε 1/10 από τα κρεμμύδια ψιλοκομμένα και τα σκόρδα μαζι με το κρέας. Κατόπιν ρίχνετε τον τοματοπολτό αραιωμένο με ζωμό απο το ξαφρισμένο κρέας και προσθέτετε αλάτι, πιπέρι, μπαχάρι, κανέλα ξυλάκι, δεντρολίβανο, τα φύλλα δάφνης και αφήνετε το κρεας να βράσει. Αφού βράσει το αφαιρείτε απο το ζωμό του και μέρα ρίχνετε τα κρεμμύδια καθαρισμένα και ολόκληρα, εαν είναι μικρά, χαραγμένα στα πλάγια, αφού πρώτα τα έχετε περάσει ελαφρώς σε καυτό λάδι. Εάν είναι μεγάλα τα κρεμμύδια τα κόβετε λίγο χοντροκομμένα και τα περνάτε και αυτά ελαφρώς από καυτό λάδι. Τα ρίχνετε στο ζωμό του κρέατος και ρίχνετε το ξύδι. Όταν βράζουν, για να μην διαλυθούν, δεν τα ανακατεύετε, αλλά κουνάτε ελαφρώς την κατσαρόλα για να μην κολλήσουν.",
    },
    {
      key: "14",
      extrainfo:
        "Προσέχουμε οραν ρίξουμε το αυγολέμονο να μην καίει πολύ το φαγητό μας, γιατί το αυγολέμονο θα κόψει.",
    },
    {
      key: "15",
      extrainfo: "Όταν περασουμε τα κρεμμύδια ελαφρώς από το καυτό λάδι, πρέπει να τα βάλουμε σε ένα σουρωτήρι να στραγγίσουν από τα λάδια.",
    },
    {
      key: "16",
      extrainfo: "Το φαγητό πρέπει να βγεί με λίγα υγρά",
    },
    {
      key: "17",
      extrainfo: "Στιφάδο μπρούμε να φτιάξουμε και με κοτόπουλο ή λαγό ή κουνέλι.",
    },
    
  ]

const foodname = ""
const img = ""
const description = ""
const extrainfo = " Το φαγητό πρέπει να βγεί με λίγα υγρά. Στιφάδο μπρούμε να φτιάξουμε και με κοτόπουλο ή λαγό ή κουνέλι."
  
 
  return (
    <div>
      <FoodRecipe
        setInputValue={setInputValue}  
        inputValue={inputValue}
        name={foodname}
        img={img}
        data={data}
        description={description}
        extrainfo={extrainfo}
      />
    </div>
  );
};

export default RecipePage3;
