import React from "react";
import FoodRecipe from "./FoodRecipe";
import { useState, useEffect } from "react";
import { useLocation } from "react-router-dom";

const RecipePage4 = (props) => {
  const [inputValue, setInputValue] = useState(100);

  const data = [
    {
      key: "1",
      in: 23,
      name: "Χοιρινό:",
      end: "κιλά",
    },
    {
      key: "2",
      in: 25,
      name: "Σέλινο:",
      end: "κιλά",
    },
    {
      key: "3",
      in: 3,
      name: "Λάδι:",
      end: "κιλά",
    },
    {
      key: "4",
      in: 2.5,
      name: "Κρεμμύδια:",
      end: "κιλά",
    },
    {
      key: "5",
      in: 30,
      name: "Αυγά:",
      end: "τεμάχια",
    },
    {
      key: "6",
      in: 3,
      name: "Χυμός Λεμόνι:",
      end: "φιάλες",
    },
    {
      key: "7",
      in: "",
      name: "Αλάτι",
      end: "",
    },
    {
      key: "8",
      in: "",
      name: "Πιπέρι",
      end: "",
    },
    {
      key: "9",
      in: "",
      name: "",
      end: "",
    },
    {
      key: "10",
      in: "",
      name: "",
      end: "",
    },
    {
      key: "11",
      foodname: "ΧΟΙΡΙΝΟ ΜΕ ΣΕΛΙΝΟ ΑΥΓΟΛΕΜΟΝΟ",
    },
    {
      key: "12",
      img: "https://caruso.gr/wp-content/uploads/2020/10/Xoirino-prasoselino_201012_0305.jpg",
    },
    {
      key: "13",
      description:
        "Κόβετε το χοιρινό σε μερίδες, το πλένετε και το στραγγίζετε. Βάζετε στην κατσαρόλα σας το λάδι. Αφού κάψει ελαφρά, ρίχνετε το κρέας και τα ψιλοκομμένα κρεμμύδια και τα αχνίζετε. Προσθέτετε νερό και το αφήνετε να βράσει ρίχνοντασ αλάτι και πιπέρι. Καθαρίζετε τα σέλινα αφαιρώντας τις ρίζες, τα κόβετε και τα πλένετε καλά. Βάζετε νερό σε μια κατσαρόλα και αφού κάψει, ρίχνετε τα σέλινα και τα ζεματάτε για 4-5 λεπτά. Τα στραγγίζετε και κατόπιν τα ρίχνετε στο χοιρινό που εν τω μεταξύ έχει βράσει. Εάν η ποσότητα του κρέατος είναι μεγάλη, αφαιρείτε το κρέας και ρίχνετε τα σέλινα στο ζωμό για να μπορείτε να κάνετε διανομή. Αφού βράσουν τα σέλινα, ετοιμάζετε το αυγολέμονο ως εξής: Χτυπάτε χωριστά τα ασπράδια από τους κρόκους. Εκεί που έχετε τα ασπράδια ρίχνετε τους χτυπημένους κρόκους και τα δουλεύετε καλά με το σύρμα σας. Ρίχνετε αρκετό ζεστό ζωμό από τα σέλινα και ρίχνετε το αυγολέμονο στην κατσαρόλα και ανακατεύετε εκτός φωτιάς.",
    },
    {
      key: "14",
      extrainfo:
        "Προσέχουμε οραν ρίξουμε το αυγολέμονο να μην καίει πολύ το φαγητό μας, γιατί το αυγολέμονο θα κόψει.",
    },
    {
      key: "15",
      extrainfo: "Το φαγητό πρέπει να βγεί με λίγα υγρά",
    },
  ];

  return (
    <div>
      <FoodRecipe
        setInputValue={setInputValue}
        inputValue={inputValue}
        data={data}
      />
    </div>
  );
};

export default RecipePage4;
