import React from "react";
import FoodRecipe from "./FoodRecipe";
import { useState, useEffect } from "react";
import { useLocation } from "react-router-dom";


const RecipePage6 = (props) => {

 
  const [inputValue, setInputValue] = useState(100); 

  const data_ = [  

    {
      key:"1",
      in:20,
      name:"Μοσχάρι:",
      end:"κιλά" 
    },
    {
      key:"2",
      in:1.5,
      name:"Λάδι:",
      end:"κιλά" 
    },
    {
      key:"3",
      in:1,
      name:"Τοματοπολτός:",
      end:"κιλά" 
    },
    {
      key:"4",
      in:2.5,
      name:"Κρεμμύδια:",
      end:"κιλά" 
    },
    
        
    {
      key:"5",
      in:0.5,
      name:"Κρασί Λευκό:",
      end:"λίτρα" 
    },
    {
      key:"6",
      in:0.4,
      name:"Αλεύρι:",
      end:"κιλά" 
    },
    {
      key:"7",
      in:"",
      name:"Πιπέρι / Αλάτι",
      end:"" 
    },
    {
      key:"8",
      in:"",
      name:"Φύλλα Δάφνης",
      end:"" 
    },
    {
      key:"9",
      in:"",
      name:"Κανέλα ξυλάκι",
      end:"" 
    },
    {
      key:"10",
      in:5,
      name:"Μαιντανός",
      end:"ματσάκια" 
    },
    {
      key:"11",
      foodname:"ΜΟΣΧΑΡΙ ΤΑΣ ΚΕΜΠΑΠ",
    },
    {
      key:"12",
      img:"https://www.sintayes.gr/wp-content/uploads/2014/09/3242.jpg",
    },
    {
      key:"13",
      description:"Κόβετε το κρέας σε μικρά κομμάτια, το πλένετε και το στραγγίζετε. Κατόπιν, το ρίχνετε σε μια κατσαρόλα με νερό και το αφήνετε να πάρει μια βράση, το ξαφρίζετε με μια τρυπητή κουτάλα και το μισοβράζετε. Μετά το στραγγίζετε και το κρατάτε τα υγρά του. Κατόπιν, βάζετε λάδι να κάψει σε μια κατσαρόλα, ρίχνετε το χιλοκομμένο κρεμμύδι να τσιγαρισθεί, μετά τσιγαρίζετε το κρέας για λίγο και ρίχνετε το αλεύρι πασπαλιστα να καβουρδισθεί. Μόλις πάρει χρώμα το αλεύρι, σβήνετε το κρέας με το κρασί και προσθέτετε τον τοματοπολτό αραιωμένο με ζωμό απο το μισοβρασμνένο κρέας, μέχρι να σκεπαστεί καλά το κρέας. Ρίχνετε αλάτι, πιπέρι, κανέλα ξυλάκι, τον ψιλοκομμενο μαϊντανό, τα φύλλα δάφνης και το αφήνετε να βράσει. Εάν κατά το βρασμό χρειασθεί υγρά, προσθέτετε απο το μισοβρασμένο κρέας ζεστό ζουμί. Το κρέας τας κεμπαπ σερβίρεται συνήθως με ρύζι πιλάφι, πατάτες τηγανητές, πουρέ πατάτας και μακαρόνια βουτήρου.",
    },
    {
      key:"14",
      extrainfo:"Το μοσχάρι πρέπει να το ξαφρίσετε και μετά να το μαγειρέψετε.",
    },
    {
      key:"15",
      extrainfo:"Από τα υγρά του μισοβρασμένου κρέατος φτιάχνεται και το ρύζι πιλάφι.",
    },
        
  ]

  return (
    <div>
      <FoodRecipe
        setInputValue={setInputValue}  
        inputValue={inputValue}              
        data={data_}       
      />
    </div>
  );
};

export default RecipePage6;
