import React from "react";
import FoodRecipe from "./FoodRecipe";
import { useState, useEffect } from "react";


const RecipePage2 = (data) => {



  
 
  return (
    <div>
      <FoodRecipe
        
        
        name="ΚΡΕΑΣ ΚΟΚΚΙΝΙΣΤΟ"
        img="https://paxxi.gr/wp-content/uploads/2020/01/moshari-kokkinisto.jpg"

        in1={20}
        in1name=" Βοδινό: " 
        in1end=" κιλά "

        in2={400}
        in2name=" Πατάτες:"
        in2end=" γραμ."

        in3={2}
        in3name=" Λάδι:"
        in3end=" κιλά"

        in4=""
        in4name=" Αλάτι"
        in4end=""

        in5=""
        in5name=" Πιπέρι"
        in5end=""

        in6={2.5}
        in6name=" Κρεμμύδια:"
        in6end="κιλά"

        in7={1}
        in7name=" Τοματοπολτός: "
        in7end="κιλά"

        in8={12}
        in8name=" EXTRA: Μουστάρδα Σκόνη/Πάστα"
        in8end=" ξυλάκια"

        in9=""
        in9name=""
        in9end=""

        in10=""
        in10name=""
        in10end=""


        description="Κόβετε το κρέας σε μερίδες. Το πλένετε και το βάζετε σε τρυπητό να στραγγίσει. Κατόπιν κόβετε ψιλό κρεμμύδι και το τσιγαρίζετε με λάδι.
        Ρίχνετε και το κρέας να τσιγαρισθεί και μόλις πάρει χρώμα το πασπαλίζετε με το αλεύρι, ρίχνετε τον τοματοπολτό αραιωμένο με νερό να σκεπαστεί το κρέας,
        προσθέτετε ανάλογο αλάτι, πιπέρι, κανέλα ξυλάκι και το αφήνετε να βράσει ανακατεύοντας κάπου, κάπου. Εάν χρειασθεί προσθέτετε ζεστό νερό.
        Το κοκκινιστό κρέας σερβίρεται με μακαρόνια βουτύρου, ρύζι πιλάφι, πατάτες πουρέ, πατάτες τηγανιτές"
        extrainfo="Το κοκκινιστό κρέας πρέπει να βγεί με λίγα νερά. Το κρέας, εάν θέλουμε, προτου το μαγειρέψουμε, μπορούμε να το βάλουμε σε κατσαρόλα με το νερό να πάρει μια βράση
        όταν πάρει την πρώτη βράση το ξαφρίζουμε και μετά το μαγειρεύουμε χρησιμοποιώντας τα υγρά του στο φαγητό αντί για νερό"
      />
    </div>
  );
};

export default RecipePage2;
